import ObjectUtil from "../ObjectUtil.js";

const normalCharsExp = /^[a-z2689:.\-_+()*&^%><;"'}{~,]+$/i;

// prettier-ignore
const lookalikeChars = Object.freeze({
    0: ["0", "⓪", "₀", "⁰", "𝟢", "𝟘", "０", "𝟎", "𝟬", "𝟶"],
    1: ["⑴", "➀", "❶", "⓵", "①", "₁", "¹", "𝟣", "𝟙", "１", "𝟏", "𝟭", "𝟷"],
    2: ["⑵", "➋", "➁", "❷", "⓶", "②", "₂", "²", "𝟤", "𝟚", "２", "𝟐", "𝟮", "𝟸"],
    3: ["⑶", "➌", "➂", "❸", "⓷", "③", "₃", "³", "𝟥", "𝟛", "３", "𝟑", "𝟯", "𝟹"],
    4: ["⑷", "➍", "➃", "❹", "⓸", "④", "₄", "⁴", "𝟦", "𝟜", "４", "𝟒", "𝟰", "𝟺"],
    5: ["⑸", "➎", "➄", "❺", "⓹", "⑤", "₅", "⁵", "𝟧", "𝟝", "５", "𝟓", "𝟱", "𝟻"],
    6: ["⑹", "➏", "➅", "❻", "⓺", "⑥", "₆", "⁶", "𝟨", "𝟞", "６", "𝟔", "𝟲", "𝟼"],
    7: ["⑺", "➐", "➆", "❼", "⓻", "⑦", "₇", "⁷", "𝟩", "𝟟", "７", "𝟕", "𝟳", "𝟽"],
    8: ["⑻", "➑", "➇", "❽", "⓼", "⑧", "₈", "⁸", "𝟪", "𝟠", "８", "𝟖", "𝟴", "𝟾"],
    9: ["⑼", "➒", "➈", "❾", "⓽", "⑨", "₉", "⁹", "𝟫", "𝟡", "９", "𝟗", "𝟵", "𝟿"],

    a: [
        "ﾑ", "ａ", "Ａ", "＠", "🇦", "🅰", "🅐", "🄰", "𝞪", "𝞐", "𝝰", "𝝖", "𝜶", "𝜜", "𝛼", "𝛢", "𝛂", "𝚨", "𝚊", "𝙰", "𝙖", "𝘼", "𝘢", "𝘈", "𝗮", "𝗔", "𝖺", "𝖠", "𝖆", "𝕬", "𝕒", "𝔸", "𝔞", "𝔄", "𝓪", "𝓐", "𝒶", "𝒜", "𝒂", "𝑨", "𝑎", "𝐴", "𝐚", "𝐀", "𐊠", "ꭺ", "ꓯ", "ꓮ", "ꋬ", "卂", "Ɐ", "ⓐ", "Ⓐ", "⒜", "⍺", "∆", "∀", "₳", "ₐ", "ᾼ", "Ὰ", "Ᾱ", "Ᾰ", "ᾷ", "ᾶ", "ᾴ", "ᾳ", "ᾲ", "ᾱ", "ᾰ", "ᾏ", "ᾎ", "ᾍ", "ᾌ", "ᾋ", "ᾊ", "ᾉ", "ᾈ", "ᾇ", "ᾆ", "ᾅ", "ᾄ", "ᾃ", "ᾂ", "ᾁ", "ᾀ", "ὰ", "ἇ", "ἆ", "ἅ", "ἄ", "ἃ", "ἂ", "ἁ", "ἀ", "ặ", "Ặ", "ẵ", "Ẵ", "ẳ", "Ẳ", "ằ", "Ằ", "ắ", "Ắ", "ậ", "Ậ", "ẫ", "Ẫ", "ẩ", "Ẩ", "ầ", "Ầ", "ấ", "Ấ", "ả", "Ả", "ạ", "Ạ", "ẚ", "ḁ", "Ḁ", "ᵃ", "ᴬ", "ᴀ", "ᗩ", "ᗅ", "ᗄ", "Ꮧ", "Ꭿ", "Ꭺ", "ለ", "ค", "බ", "Թ", "ӓ", "Ӓ", "Ѧ", "а", "Д", "А", "α", "ά", "Λ", "Δ", "Α", "Ά", "ɒ", "ɑ", "ɐ", "Ⱥ", "ȧ", "Ȧ", "ǻ", "Ǻ", "ǟ", "ǎ", "Ǎ", "ą", "Ą", "ă", "Ă", "ā", "Ā", "å", "ä", "ã", "â", "á", "à", "Å", "Ä", "Ã", "Â", "Á", "À", "ª", "a", "A", "@", ":regional_indicator_a:", "4"
    ],
    b: [
        "ｂ", "Ｂ", "🇧", "🅱", "🅑", "🄱", "𝞫", "𝞑", "𝝱", "𝝗", "𝜷", "𝜝", "𝛽", "𝛣", "𝛃", "𝚩", "𝚋", "𝙱", "𝙗", "𝘽", "𝘣", "𝘉", "𝗯", "𝗕", "𝖻", "𝖡", "𝖇", "𝕻", "𝕭", "𝕓", "𝔹", "𝔟", "𝔓", "𝔅", "𝓫", "𝓑", "𝒷", "𝒃", "𝑩", "𝑏", "𝐵", "𝐛", "𝐁", "𐑂", "𐌁", "𐊡", "𐊂", "ꮟ", "ꞵ", "Ꞵ", "ꓭ", "ꓐ", "乃", "ⓑ", "Ⓑ", "⒝", "ℬ", "ḇ", "Ḇ", "ḅ", "Ḅ", "ḃ", "Ḃ", "ᵇ", "ᴮ", "ᛒ", "ᙠ", "ᗷ", "ᖯ", "ᏼ", "Ᏼ", "Ᏸ", "Ꮟ", "ც", "Ⴆ", "๖", "๒", "฿", "ط", "ҍ", "ѣ", "ь", "ъ", "в", "Ь", "В", "Б", "ϐ", "β", "Β", "ʙ", "ɮ", "ɞ", "ƅ", "Ƅ", "ƀ", "ß", "b", "B", ":regional_indicator_b:"
    ],
    c: [
        "ｃ", "Ｃ", "🝌", "🇨", "🅲", "🅒", "🄲", "𝚌", "𝙲", "𝙘", "𝘾", "𝘤", "𝘊", "𝗰", "𝗖", "𝖼", "𝖢", "𝖈", "𝕮", "𝕔", "𝔠", "𝓬", "𝓒", "𝒸", "𝒞", "𝒄", "𝑪", "𝑐", "𝐶", "𝐜", "𝐂", "𐑋", "𐐽", "𐐣", "𐐕", "𐌂", "𐊢", "ꮯ", "ꓛ", "ꓚ", "匚", "ⲥ", "Ⲥ", "ⓒ", "Ⓒ", "⒞", "↻", "ↄ", "Ↄ", "ⅽ", "Ⅽ", "ℭ", "℃", "ℂ", "₵", "ḉ", "Ḉ", "ᶜ", "ᴐ", "ᴄ", "ᑢ", "ᑕ", "Ꮳ", "Ꮯ", "ፈ", "ር", "ᄃ", "ၥ", "၁", "ང", "උ", "ҫ", "Ҁ", "с", "С", "Ͻ", "Ϲ", "ϲ", "Ϛ", "ς", "ͻ", "ʗ", "ɕ", "ɔ", "Ȼ", "ƈ", "Ɔ", "č", "Č", "ċ", "Ċ", "ĉ", "Ĉ", "ć", "Ć", "ç", "Ç", "©", "¢", "c", "C", ":regional_indicator_c:"
    ],
    d: [
        "ｄ", "Ｄ", "🇩", "🅳", "🅓", "🄳", "𝚍", "𝙳", "𝙙", "𝘿", "𝘥", "𝘋", "𝗱", "𝗗", "𝖽", "𝖣", "𝖉", "𝕯", "𝕕", "𝔻", "𝔡", "𝔇", "𝓭", "𝓓", "𝒹", "𝒟", "𝒅", "𝑫", "𝑑", "𝐷", "𝐝", "𝐃", "ꭰ", "ꓷ", "ꓓ", "ꓒ", "ⓓ", "Ⓓ", "⒟", "∂", "ↁ", "ⅾ", "Ⅾ", "ⅆ", "ⅅ", "₫", "ḓ", "Ḓ", "ḑ", "Ḑ", "ḏ", "Ḏ", "ḍ", "Ḍ", "ḋ", "Ḋ", "ᵈ", "ᴰ", "ᴅ", "ᗬ", "ᗪ", "ᗡ", "ᗞ", "ᕲ", "ᑯ", "Ꮷ", "Ꮄ", "Ꭰ", "໓", "๔", "ծ", "ժ", "ԃ", "ԁ", "ɗ", "ɖ", "ƌ", "Ɗ", "đ", "Đ", "ď", "Ď", "Ð", "d", "D", ":regional_indicator_d:"
    ],
    e: [
        "ﾐ", "ｅ", "Ｅ", "ﻉ", "🇪", "🅴", "🅔", "🄴", "𝞷", "𝞢", "𝞔", "𝝽", "𝝨", "𝝚", "𝝃", "𝜮", "𝜠", "𝜉", "𝛴", "𝛦", "𝛏", "𝚺", "𝚬", "𝚎", "𝙴", "𝙚", "𝙀", "𝘦", "𝘌", "𝗲", "𝗘", "𝖾", "𝖤", "𝖊", "𝕰", "𝕖", "𝔼", "𝔢", "𝔈", "𝓮", "𝓔", "𝒆", "𝑬", "𝑒", "𝐸", "𝐞", "𝐄", "𐐩", "𐐁", "𐊆", "ꮛ", "ꭼ", "ꬲ", "ꞓ", "ꝫ", "ꓱ", "ꓰ", "乇", "㉫", "ⵉ", "ⴺ", "ⴹ", "ⳍ", "ⲉ", "ⓔ", "Ⓔ", "⒠", "⋿", "⋴", "∑", "∊", "∈", "∃", "ⅇ", "⅀", "ℰ", "ℯ", "℮", "ℇ", "€", "ₑ", "Ὲ", "ὲ", "Ἕ", "Ἔ", "Ἓ", "Ἒ", "Ἑ", "Ἐ", "ἕ", "ἔ", "ἓ", "ἒ", "ἑ", "ἐ", "ệ", "Ệ", "ễ", "Ễ", "ể", "Ể", "ề", "Ề", "ế", "Ế", "ẽ", "Ẽ", "ẻ", "Ẻ", "Ẹ", "ḝ", "Ḝ", "ḛ", "Ḛ", "ḙ", "Ḙ", "ḗ", "Ḗ", "ḕ", "Ḕ", "ᵉ", "ᴱ", "ᴈ", "ᴇ", "ᘿ", "ᗴ", "Ꮛ", "Ꭼ", "ჳ", "ཇ", "ԑ", "Ԑ", "ӡ", "ә", "Ә", "ҿ", "ҽ", "є", "э", "з", "е", "Е", "ϵ", "ξ", "ε", "έ", "Σ", "Ξ", "Ε", "ʒ", "ɜ", "ɛ", "ə", "ɘ", "Ɇ", "ȝ", "ǝ", "ƺ", "Ʃ", "Ɛ", "Ə", "Ǝ", "ě", "Ě", "ę", "Ę", "ė", "Ė", "ĕ", "Ĕ", "ē", "Ē", "ë", "ê", "é", "è", "Ë", "Ê", "É", "È", "£", "e", "E", ":regional_indicator_e:", "3"
    ],
    f: [
        "ｆ", "Ｆ", "ךּ", "🇫", "🅵", "🅕", "🄵", "𝟋", "𝚏", "𝙵", "𝙛", "𝙁", "𝘧", "𝘍", "𝗳", "𝗙", "𝖿", "𝖥", "𝖋", "𝕱", "𝕗", "𝔽", "𝔣", "𝔉", "𝓯", "𝓕", "𝒻", "𝒇", "𝑭", "𝑓", "𝐹", "𝐟", "𝐅", "𐊥", "𐊇", "ꬵ", "ꟻ", "ꞙ", "Ꞙ", "ꜰ", "ꓞ", "ꓝ", "千", "ⓕ", "Ⓕ", "⒡", "Ⅎ", "ℱ", "℉", "₣", "ẝ", "ḟ", "Ḟ", "ᶠ", "ᖷ", "ᖵ", "ᖴ", "Ꮈ", "ན", "ғ", "ϝ", "Ϝ", "ʄ", "ɟ", "ƒ", "Ƒ", "ſ", "f", "F", ":regional_indicator_f:"
    ],
    g: [
        "ｇ", "Ｇ", "ﻮ", "פֿ", "𠂎", "🇬", "🅶", "🅖", "🄶", "𝚐", "𝙶", "𝙜", "𝙂", "𝘨", "𝘎", "𝗴", "𝗚", "𝗀", "𝖦", "𝖌", "𝕲", "𝕘", "𝔾", "𝔤", "𝔊", "𝓰", "𝓖", "𝒢", "𝒈", "𝑮", "𝑔", "𝐺", "𝐠", "𝐆", "ꮐ", "ꓖ", "ⓖ", "Ⓖ", "⒢", "⅁", "ℊ", "₲", "ḡ", "Ḡ", "ᶃ", "ᵍ", "ᴳ", "ᘜ", "ᏻ", "Ᏻ", "Ꮹ", "Ꮐ", "Ꮆ", "ງ", "ق", "ց", "ԍ", "Ԍ", "Б", "ʛ", "ɢ", "ɡ", "ɠ", "ɓ", "ǵ", "Ǵ", "ǫ", "ǧ", "Ǧ", "Ǥ", "ƃ", "ģ", "Ģ", "ġ", "Ġ", "ğ", "Ğ", "ĝ", "Ĝ", "g", "G", ":regional_indicator_g:"
    ],
    h: [
        "ｈ", "Ｈ", "🇭", "🅷", "🅗", "🄷", "𝞖", "𝝜", "𝜢", "𝛨", "𝚮", "𝚑", "𝙷", "𝙝", "𝙃", "𝘩", "𝘏", "𝗵", "𝗛", "𝗁", "𝖧", "𝖍", "𝕳", "𝕙", "𝔥", "𝓱", "𝓗", "𝒽", "𝒉", "𝑯", "𝐻", "𝐡", "𝐇", "𐋏", "ꮋ", "ꓧ", "卄", "ん", "Ⲏ", "Ⱨ", "ⓗ", "Ⓗ", "⒣", "ℎ", "ℍ", "ℌ", "ℋ𝑖", "ℋ", "ₕ", "ῌ", "Ὴ", "ᾟ", "ᾞ", "ᾝ", "ᾜ", "ᾛ", "ᾚ", "ᾙ", "ᾘ", "Ἧ", "Ἦ", "Ἥ", "Ἤ", "Ἣ", "Ἢ", "Ἡ", "Ἠ", "ẖ", "ḫ", "Ḫ", "ḩ", "Ḩ", "ḧ", "Ḧ", "ḥ", "Ḥ", "ḣ", "Ḣ", "ᴴ", "ᕼ", "Ᏺ", "Ꮒ", "Ꮋ", "ዠ", "ዞ", "հ", "ԋ", "Ԋ", "Ӊ", "ӈ", "һ", "ђ", "н", "Н", "Ћ", "Η", "Ή", "ʱ", "ʰ", "ʜ", "ɧ", "ɦ", "ɥ", "Ƕ", "ħ", "Ħ", "ĥ", "Ĥ", "h", "\\#", "H", ":regional_indicator_h:"
    ],
    i: [
        "ﾉ", "ｉ", "Ｉ", "！", "ﺍ", "ﺁ", "🇮", "🅸", "🅘", "🄸", "𝚒", "𝙸", "𝙞", "𝙄", "𝘪", "𝘐", "𝗶", "𝗜", "𝗂", "𝖨", "𝖎", "𝕴", "𝕚", "𝕀", "𝔦", "𝓲", "𝓘", "𝒾", "𝒊", "𝑰", "𝑗", "𝑖", "𝐼", "𝐢", "𝐈", "𐌠", "𐌉", "𐊊", "ꭵ", "ꙇ", "ꓲ", "丨", "ⵑ", "ⵏ", "Ⲓ", "ⓘ", "Ⓘ", "⒤", "⍳", "∣", "ⅼ", "ⅰ", "Ⅰ", "ⅈ", "ℹ", "ℑ", "ℐ", "ⁱ", "Ὶ", "Ῑ", "Ῐ", "ῗ", "ῖ", "ῒ", "ῑ", "ῐ", "ὶ", "Ἷ", "Ἶ", "Ἵ", "Ἴ", "Ἳ", "Ἲ", "Ἱ", "Ἰ", "ἷ", "ἶ", "ἵ", "ἴ", "ἳ", "ἲ", "ἱ", "ἰ", "ị", "Ị", "ỉ", "Ỉ", "ḯ", "Ḯ", "ḭ", "Ḭ", "ᶤ", "ᵢ", "ᴵ", "ᛁ", "ᓰ", "Ꮖ", "Ꭵ", "ར", "เ", "ߊ", "۱", "ٱ", "١", "ا", "أ", "آ", "ו", "׀", "ӏ", "ї", "і", "І", "ϊ", "ι", "ί", "Ι", "ΐ", "ɪ", "ɨ", "ǐ", "Ǐ", "ǃ", "Ɨ", "ł", "ı", "İ", "į", "Į", "ĭ", "Ĭ", "ī", "Ī", "ĩ", "Ĩ", "ï", "î", "í", "ì", "Ï", "Î", "Í", "Ì", "¡", "i", "\\￨", "\\ǀ", "I", ":regional_indicator_i:", "!"
    ],
    j: [
        "ﾌ", "ｊ", "Ｊ", "ﻝ", "🇯", "🅹", "🅙", "🄹", "𝚓", "𝙹", "𝙟", "𝙅", "𝘫", "𝘑", "𝗷", "𝗝", "𝗃", "𝖩", "𝖏", "𝕵", "𝕛", "𝕁", "𝔧", "𝔍", "𝓳", "𝓙", "𝒿", "𝒥", "𝒋", "𝑱", "𝐽", "𝐣", "𝐉", "ꭻ", "Ʝ", "ꞁ", "ꓙ", "ⱼ", "ⓙ", "Ⓙ", "⒥", "ⅉ", "ᴶ", "ᴊ", "ᒚ", "ᒎ", "ᒍ", "Ꮰ", "Ꭻ", "ว", "ڶ", "ل", "ز", "נ", "ן", "ј", "Ј", "ϳ", "Ϳ", "ʲ", "ʝ", "Ɉ", "ǰ", "ĵ", "Ĵ", "j", "J", ":regional_indicator_j:"
    ],
    k: [
        "ｋ", "Ｋ", "🇰", "🅺", "🅚", "🄺", "𝟆", "𝞳", "𝞙", "𝞌", "𝝹", "𝝟", "𝝒", "𝜿", "𝜥", "𝜘", "𝜅", "𝛫", "𝛞", "𝛋", "𝚱", "𝚔", "𝙺", "𝙠", "𝙆", "𝘬", "𝘒", "𝗸", "𝗞", "𝗄", "𝖪", "𝖐", "𝕶", "𝕜", "𝕂", "𝔨", "𝔎", "𝓴", "𝓚", "𝓀", "𝒦", "𝒌", "𝑲", "𝑘", "𝐾", "𝐤", "𝐊", "𐒼", "ꮶ", "Ꝁ", "ꓗ", "ⲕ", "Ⲕ", "ⓚ", "Ⓚ", "⒦", "⋊", "K", "₭", "ₖ", "ḵ", "Ḵ", "ḳ", "Ḳ", "ḱ", "Ḱ", "ᵏ", "ᴷ", "ᴋ", "ᛕ", "ᖽᐸ", "Ꮶ", "ӄ", "Ӄ", "Ҡ", "ҟ", "Ҝ", "қ", "к", "К", "Ќ", "ϰ", "ϗ", "κ", "Κ", "ʞ", "ƙ", "ĸ", "ķ", "Ķ", "k", "K", ":regional_indicator_k:"
    ],
    l: [
        "ﾚ", "ｌ", "Ｌ", "ﺎ", "ﺂ", "🇱", "🅻", "🅛", "🄻", "𝚕", "𝙻", "𝙡", "𝙇", "𝘭", "𝘓", "𝗹", "𝗟", "𝗅", "𝖫", "𝖑", "𝕷", "𝕝", "𝕃", "𝔩", "𝔏", "𝓵", "𝓛", "𝓁", "𝒍", "𝑳", "𝑙", "𝐿", "𝐥", "𝐋", "𐑃", "𐐛", "ꮮ", "Ꝉ", "ꓡ", "ㄥ", "し", "ⳑ", "Ⳑ", "Ⱡ", "ⓛ", "Ⓛ", "⒧", "Ⅼ", "⅃", "⅂", "ℓ", "ℒ", "ₗ", "ḽ", "Ḽ", "ḻ", "Ḻ", "ḹ", "Ḹ", "ḷ", "Ḷ", "ᴸ", "ᒺ", "ᒪ", "Ꮮ", "Ꮭ", "Ꮁ", "ᄂ", "Ӏ", "ˡ", "ʟ", "ʆ", "ʅ", "ɭ", "ɫ", "ƪ", "Ɩ", "ł", "Ł", "ŀ", "Ŀ", "ľ", "Ľ", "ļ", "Ļ", "ĺ", "Ĺ", "l", "L", ":regional_indicator_l:"
    ],
    m: [
        "ﾶ", "ｍ", "Ｍ", "🇲", "🅼", "🅜", "🄼", "𝞛", "𝝡", "𝜧", "𝛭", "𝚳", "𝚖", "𝙼", "𝙢", "𝙈", "𝘮", "𝘔", "𝗺", "𝗠", "𝗆", "𝖬", "𝖒", "𝕸", "𝕞", "𝕄", "𝔪", "𝔐", "𝓶", "𝓜", "𝓂", "𝒎", "𝑴", "𝑚", "𝑀", "𝐦", "𝐌", "𐌑", "𐊰", "ꮇ", "ꓟ", "爪", "Ⲙ", "ⓜ", "Ⓜ", "⒨", "Ⅿ", "ℳ", "₥", "ₘ", "ṃ", "Ṃ", "ṁ", "Ṁ", "ḿ", "Ḿ", "ᵐ", "ᴹ", "ᴍ", "៣", "ᛖ", "ᘻ", "ᗰ", "Ꮇ", "๓", "Ӎ", "м", "М", "ϻ", "Ϻ", "Μ", "ʍ", "ɱ", "ɯ", "m", "M", ":regional_indicator_m:"
    ],
    n: [
        "ｎ", "Ｎ", "🇳", "🅽", "🅝", "🄽", "𝞜", "𝝢", "𝜨", "𝛮", "𝚴", "𝚗", "𝙽", "𝙣", "𝙉", "𝘯", "𝘕", "𝗻", "𝗡", "𝗇", "𝖭", "𝖓", "𝕹", "𝕟", "𝔫", "𝔑", "𝓷", "𝓝", "𝓃", "𝒩", "𝒏", "𝑵", "𝑛", "𝑁", "𝐧", "𝐍", "𐑍", "𐐥", "ꓵ", "ꓠ", "刀", "几", "Ⲡ", "Ⲛ", "ⓝ", "Ⓝ", "⒩", "⋂", "∏", "ℿ", "ℕ", "₦", "ₙ", "ⁿ", "ῇ", "ῆ", "ῄ", "ῃ", "ῂ", "ᾗ", "ᾖ", "ᾕ", "ᾔ", "ᾓ", "ᾒ", "ᾑ", "ᾐ", "ὴ", "ἧ", "ἦ", "ἥ", "ἤ", "ἣ", "ἢ", "ἡ", "ἠ", "ṋ", "Ṋ", "ṉ", "Ṉ", "ṇ", "Ṇ", "ṅ", "Ṅ", "ᶰ", "ᴺ", "ᴎ", "ហ", "ᘉ", "ᑎ", "Ꮑ", "ቡ", "በ", "ຖ", "ภ", "ก", "מ", "ռ", "ո", "ղ", "Ռ", "Ո", "ӣ", "ѝ", "й", "и", "П", "Й", "И", "Ѝ", "Ϟ", "η", "ή", "Π", "Ν", "ͷ", "Ͷ", "ɴ", "ɳ", "ɲ", "Ǹ", "ƞ", "Ɲ", "ŋ", "ŉ", "ň", "Ň", "ņ", "Ņ", "ń", "Ń", "ñ", "Ñ", "n", "N", ":regional_indicator_n:"
    ],
    o: [
        "ｏ", "Ｏ", "ﻬ", "ﻫ", "ﻪ", "ﻩ", "ﮭ", "ﮬ", "ﮫ", "ﮪ", "ﮩ", "ﮨ", "ﮧ", "ﮦ", "🇴", "🅾", "🅞", "🄾", "𝞼", "𝞸", "𝞞", "𝞂", "𝝾", "𝝤", "𝝈", "𝝄", "𝜪", "𝜎", "𝜊", "𝛰", "𝛔", "𝛐", "𝚶", "𝚘", "𝙾", "𝙤", "𝙊", "𝘰", "𝘖", "𝗼", "𝗢", "𝗈", "𝖮", "𝖔", "𝕺", "𝕠", "𝕆", "𝔬", "𝔒", "𝓸", "𝓞", "𝒪", "𝒐", "𝑶", "𝑜", "𝑂", "𝐨", "𝐎", "𐓪", "𐓃", "𐓂", "𐐬", "𐐄", "𐊫", "𐊒", "ꬽ", "Ꙩ", "ꓳ", "㊉", "ㄖ", "の", "〇", "ⵙ", "ⵔ", "ⲟ", "Ⲟ", "⨀", "✿", "☉", "ⓞ", "Ⓞ", "⒪", "⍥", "⊙", "∅", "ℴ", "ₒ", "Ὼ", "Ὸ", "ᾯ", "ᾮ", "ᾭ", "ᾬ", "ᾫ", "ᾪ", "ᾩ", "ᾨ", "ὸ", "Ὧ", "Ὦ", "Ὥ", "Ὤ", "Ὣ", "Ὢ", "Ὡ", "Ὠ", "Ὅ", "Ὄ", "Ὃ", "Ὂ", "Ὁ", "Ὀ", "ὅ", "ὄ", "ὃ", "ὂ", "ὁ", "ὀ", "ỡ", "Ỡ", "ở", "Ở", "ờ", "Ờ", "ớ", "Ớ", "ộ", "Ộ", "Ỗ", "ổ", "Ổ", "ồ", "Ồ", "ố", "Ố", "ỏ", "Ỏ", "ọ", "Ọ", "ṓ", "Ṓ", "ṑ", "Ṑ", "ṏ", "Ṏ", "ṍ", "Ṍ", "ð", "ᵒ", "ᴼ", "ᴑ", "ᴏ", "ᗝ", "ᓍ", "Ꮎ", "Ꭷ", "ዐ", "ჿ", "၀", "ဝ", "໐", "๐", "๏", "ට", "൦", "ഠ", "೦", "౦", "௦", "୦", "ଠ", "૦", "੦", "০", "०", "߀", "۵", "۝", "ە", "ہ", "ھ", "٥", "ه", "ס", "օ", "Օ", "Ө", "ӧ", "Ӧ", "ѻ", "о", "Ф", "О", "ό", "φ", "σ", "ο", "θ", "Ο", "Θ", "˚", "ʘ", "ǿ", "Ǿ", "ǒ", "Ǒ", "Ʊ", "ơ", "Ơ", "ő", "Ő", "ŏ", "Ŏ", "ō", "Ō", "ø", "ö", "õ", "ô", "ó", "ò", "ð", "Ø", "Ö", "Õ", "Ô", "Ó", "Ò", "º", "°", "o", "O", "♡", ":regional_indicator_o:", "0"
    ],
    p: [
        "ｱ", "ｐ", "Ｐ", "🇵", "🅿", "🅟", "🄿", "𝟈", "𝞺", "𝞠ϱ", "𝞠", "𝞎", "𝞀", "𝝦", "𝝔", "𝝆", "𝜬", "𝜚", "𝜌", "𝛲", "𝛠", "𝛒", "𝚸", "𝚙", "𝙿", "𝙥", "𝙋", "𝘱", "𝘗", "𝗽", "𝗣", "𝗉", "𝖯", "𝖕", "𝕡", "𝔭", "𝓹", "𝓟", "𝓅", "𝒫", "𝒑", "𝑷", "𝑝", "𝑃", "𝐩", "𝐏", "𐓄", "𐊕", "ꮲ", "ꓑ", "卩", "ⲣ", "Ⲣ", "Ᵽ", "ⓟ", "Ⓟ", "⒫", "⍴", "ℙ", "℘", "₱", "ₚ", "‽", "Ῥ", "ῥ", "ῤ", "ṗ", "Ṗ", "ṕ", "Ṕ", "ᵖ", "ᴾ", "ᴩ", "ᴘ", "ᕵ", "ᑭ", "Ꮲ", "Ꭾ", "ק", "ք", "բ", "Ԁ", "Ҏ", "р", "Р", "ϸ", "Ϸ", "ϱ", "ρ", "Ρ", "ƿ", "Ƥ", "þ", "Þ", "¶", "p", "P", ":regional_indicator_p:"
    ],
    q: [
        "ｑ", "Ｑ", "🇶", "🆀", "🅠", "🅀", "𝚚", "𝚀", "𝙦", "𝙌", "𝘲", "𝘘", "𝗾", "𝗤", "𝗊", "𝖰", "𝖖", "𝕼", "𝕢", "𝔮", "𝔔", "𝓺", "𝓠", "𝓆", "𝒬", "𝒒", "𝑸", "𝑞", "𝑄", "𝐪", "𝐐", "𐌒", "𐊭", "ꟼ", "Ꝗ", "ゐ", "ⵕ", "ⓠ", "Ⓠ", "⒬", "ℚ", "ợ", "ᶐ", "ᕴ", "ᑫ", "Ꭴ", "๑", "۹", "ף", "զ", "գ", "ԛ", "Ҩ", "ϥ", "ϙ", "Ϙ", "Ω", "ʠ", "ɋ", "Ɋ", "ǭ", "Ǭ", "Ǫ", "ƍ", "q", "Q", ":regional_indicator_q:"
    ],
    r: [
        "ｒ", "Ｒ", "🇷", "🆁", "🅡", "🅁", "𝞒", "𝝘", "𝜞", "𝛤", "𝚪", "𝚛", "𝚁", "𝙧", "𝙍", "𝘳", "𝘙", "𝗿", "𝗥", "𝗋", "𝖱", "𝖗", "𝕽", "𝕣", "𝔯", "𝓻", "𝓡", "𝓇", "𝒓", "𝑹", "𝑟", "𝑅", "𝐫", "𝐑", "𐒴", "ꮢ", "ꮁ", "ꭱ", "ꭈ", "ꭇ", "ꓣ", "尺", "ⲅ", "Ɽ", "ⓡ", "Ⓡ", "⒭", "℞", "ℝ", "ℜ", "ℛ", "ṟ", "Ṟ", "ṝ", "Ṝ", "ṛ", "Ṛ", "ṙ", "Ṙ", "ᵣ", "ᴿ", "ᴦ", "ᴚ", "ᴙ", "ᚱ", "ᖇ", "Ꮢ", "Ꭱ", "འ", "ཞ", "ર", "ր", "Ի", "я", "г", "Я", "ʳ", "ʁ", "ʀ", "ɿ", "ɾ", "ɼ", "ɹ", "Ɍ", "Ʀ", "ř", "Ř", "ŗ", "Ŗ", "ŕ", "Ŕ", "®", "r", "R", ":regional_indicator_r:"
    ],
    s: [
        "ｓ", "Ｓ", "＄", "ﮎ", "🇸", "🆂", "🅢", "🅂", "𝚜", "𝚂", "𝙨", "𝙎", "𝘴", "𝘚", "𝘀", "𝗦", "𝗌", "𝖲", "𝖘", "𝕾", "𝕤", "𝕊", "𝔰", "𝔖", "𝓼", "𝓢", "𝓈", "𝒮", "𝒔", "𝑺", "𝑠", "𝑆", "𝐬", "𝐒", "𐑈", "𐐠", "𐊖", "ꮪ", "ꜱ", "ꙅ", "Ꙅ", "ꓢ", "꒚", "丂", "ⓢ", "Ⓢ", "⒮", "∫", "₴", "ₛ", "ṩ", "Ṩ", "ṧ", "Ṧ", "ṥ", "Ṥ", "ṣ", "Ṣ", "ṡ", "Ṡ", "ᴤ", "ᔕ", "Ꮪ", "Ꮥ", "Ꭶ", "ร", "ى", "ֆ", "Տ", "ѕ", "Ѕ", "ϩ", "ˢ", "ʃ", "ʂ", "Ș", "ƽ", "ƨ", "Ƨ", "š", "Š", "ş", "Ş", "ŝ", "Ŝ", "ś", "Ś", "§", "s", "\\$", "S", ":regional_indicator_s:", "5"
    ],
    t: [
        "ｲ", "ｨ", "ｔ", "Ｔ", "🇹", "🆃", "🅣", "🅃", "𝞽", "𝚝", "𝚃", "𝙩", "𝙏", "𝘵", "𝘛", "𝘁", "𝗧", "𝗍", "𝖳", "𝖙", "𝕿", "𝕥", "𝕋", "𝔱", "𝔗", "𝓽", "𝓣", "𝓉", "𝒯", "𝒕", "𝑻", "𝑡", "𝑇", "𝐭", "𝐓", "𐌕", "𐊱", "𐊗", "ꭲ", "ꓔ", "꓄", "丅", "ㄒ", "Ⲧ", "Ⲅ", "⟙", "ⓣ", "Ⓣ", "⒯", "⊥", "⊤", "ℾ", "₮", "ₜ", "†", "ẗ", "ṱ", "Ṱ", "ṯ", "Ṯ", "ṭ", "Ṭ", "ṫ", "Ṫ", "ᵗ", "ᵀ", "ᴛ", "ᖶ", "ᒥ", "Ꮦ", "Ꮏ", "Ꮁ", "Ꭲ", "ኮ", "ح", "է", "Շ", "Ի", "Ե", "ҭ", "т", "Т", "Г", "ϯ", "Ϯ", "τ", "π", "Τ", "Γ", "Ͳ", "ʈ", "ʇ", "ɬ", "ȶ", "ț", "Ț", "ǂ", "Ʈ", "Ƭ", "ƫ", "ƚ", "ŧ", "ť", "Ť", "ţ", "Ţ", "t", "T", ":regional_indicator_t:", "7"
    ],
    u: [
        "ｕ", "Ｕ", "🇺", "🆄", "🅤", "🅄", "𝞵", "𝝻", "𝝁", "𝜇", "𝛍", "𝚞", "𝚄", "𝙪", "𝙐", "𝘶", "𝘜", "𝘂", "𝗨", "𝗎", "𝖴", "𝖚", "𝖀", "𝕦", "𝕌", "𝔲", "𝔘", "𝓾", "𝓤", "𝓊", "𝒰", "𝒖", "𝑼", "𝑢", "𝑈", "𝐮", "𝐔", "𐓶", "𐓎", "ꭒ", "ꭎ", "ꞟ", "ꓴ", "ㄩ", "ひ", "ⓤ", "Ⓤ", "⒰", "⋃", "∪", "∩", "℧", "ῧ", "ῦ", "ῢ", "ῡ", "ῠ", "ὺ", "ὗ", "ὖ", "ὕ", "ὔ", "ὓ", "ὒ", "ὑ", "ὐ", "ự", "Ự", "Ữ", "ử", "Ử", "ừ", "Ừ", "ứ", "Ứ", "ủ", "Ủ", "ụ", "Ụ", "ṻ", "Ṻ", "ṹ", "Ṹ", "ṷ", "Ṷ", "ṵ", "Ṵ", "ṳ", "Ṳ", "ᵾ", "ᵤ", "ᵘ", "ᵁ", "ᴜ", "ᘴ", "ᘮ", "ᓑ", "ᑘ", "ᑌ", "ᐡ", "Ꮼ", "ሆ", "ሀ", "ย", "น", "પ", "և", "ս", "մ", "Ս", "Մ", "Ц", "ύ", "ϋ", "υ", "μ", "ΰ", "ʋ", "ʊ", "Ʉ", "Ȕ", "ǜ", "Ǜ", "ǚ", "Ǚ", "ǘ", "Ǘ", "ǖ", "Ǖ", "ǔ", "Ǔ", "Ʊ", "ư", "Ư", "ų", "Ų", "ű", "Ű", "ů", "Ů", "ŭ", "Ŭ", "ū", "Ū", "ũ", "Ũ", "û", "ú", "ù", "Ü", "Û", "Ú", "Ù", "µ", "u", "U", ":regional_indicator_u:"
    ],
    v: [
        "ｖ", "Ｖ", "🇻", "🆅", "🅥", "🅅", "𝝼", "𝝂", "𝜈", "𝛎", "𝚟", "𝚅", "𝙫", "𝙑", "𝘷", "𝘝", "𝘃", "𝗩", "𝗏", "𝖵", "𝖛", "𝖁", "𝕧", "𝕍", "𝔳", "𝔙", "𝓿", "𝓥", "𝓋", "𝒱", "𝒗", "𝑽", "𝑣", "𝑉", "𝐯", "𝐕", "𐓘", "𐒰", "𐌡", "𐊍", "ꮩ", "ꓦ", "ꓥ", "ⴸ", "ⴷ", "ⱽ", "ⓥ", "Ⓥ", "⒱", "⋁", "∨", "√", "ⅴ", "Ⅴ", "℣", "ṿ", "Ṿ", "ṽ", "Ṽ", "ᵥ", "ᵛ", "ᴧ", "ᴠ", "ᐺ", "ᐱ", "ᐯ", "Ꮩ", "Ꮙ", "ง", "۸", "۷", "٨", "٧", "ש", "ע", "ט", "Ѷ", "ѵ", "Ѵ", "Л", "ν", "Λ", "ʌ", "ʋ", "Ʌ", "Ɣ", "v", "V", ":regional_indicator_v:"
    ],
    w: [
        "ｗ", "Ｗ", "🇼", "🆆", "🅦", "🅆", "𝟉", "𝟂", "𝞏", "𝞈", "𝝕", "𝝎", "𝜛", "𝜔", "𝜋", "𝛡", "𝛚", "𝛑", "𝚠", "𝚆", "𝙬", "𝙒", "𝘸", "𝘞", "𝘄", "𝗪", "𝗐", "𝖶", "𝖜", "𝖂", "𝕨", "𝕎", "𝔴", "𝔚", "𝔀", "𝓦", "𝓌", "𝒲", "𝒘", "𝑾", "𝑤", "𝑊", "𝐰", "𝐖", "𐓑", "ꮃ", "ꞷ", "ꙍ", "ꓪ", "山", "ⲱ", "ⓦ", "Ⓦ", "⒲", "⍵", "ℼ", "₩", "ῷ", "ῶ", "ῴ", "ῳ", "ῲ", "ẘ", "ẉ", "Ẉ", "ẇ", "Ẇ", "ẅ", "Ẅ", "ẃ", "Ẃ", "ẁ", "Ẁ", "ᵂ", "ᴡ", "ᘺ", "ᗯ", "Ꮿ", "Ꮤ", "Ꮚ", "Ꮗ", "Ꮃ", "ሠ", "ཡ", "ຟ", "ฬ", "ฝ", "చ", "ա", "ԝ", "Ԝ", "ѡ", "Ѡ", "ш", "Щ", "ϖ", "ώ", "ω", "ψ", "ʷ", "ʍ", "ɯ", "ŵ", "Ŵ", "w", "W", ":regional_indicator_w:"
    ],
    x: [
        "ﾒ", "ｘ", "Ｘ", "אָ", "אַ", "🇽", "🆇", "🅧", "🅇", "𝟀", "𝞆", "𝝌", "𝜒", "𝛘", "𝚡", "𝚇", "𝙭", "𝙓", "𝘹", "𝘟", "𝘅", "𝗫", "𝗑", "𝖷", "𝖝", "𝖃", "𝕩", "𝕏", "𝔵", "𝔛", "𝔁", "𝓧", "𝓍", "𝒳", "𝒙", "𝑿", "𝑥", "𝑋", "𝐱", "𝐗", "𐌢", "𐌗", "𐊴", "𐊐", "ꭕ", "ꭓ", "Ꭓ", "ꓫ", "꒼", "乂", "〤", "ⵝ", "ⲭ", "Ⲭ", "⨯", "⤬", "⤫", "╳", "ⓧ", "Ⓧ", "⒳", "⌧", "ⅹ", "Ⅹ", "ℵ", "ₓ", "ẍ", "Ẍ", "ẋ", "Ẋ", "ᚷ", "᙮", "᙭", "ᕽ", "ᕁ", "ጀ", "ჯ", "א", "Ӿ", "Ӽ", "ҳ", "х", "Х", "Ж", "χ", "Χ", "ˣ", "ɤ", "×", "x", "X", ":regional_indicator_x:"
    ],
    y: [
        "ﾘ", "ｙ", "Ｙ", "🇾", "🆈", "🅨", "🅈", "𝞬", "𝝲", "𝜸", "𝛾", "𝛄", "𝚢", "𝚈", "𝙮", "𝙔", "𝘺", "𝘠", "𝘆", "𝗬", "𝗒", "𝖸", "𝖞", "𝖄", "𝕪", "𝕐", "𝔶", "𝔜", "𝔂", "𝓨", "𝓎", "𝒴", "𝒚", "𝒀", "𝑦", "𝑌", "𝐲", "𝐘", "𐊲", "ꭚ", "ꓬ", "ꐯ", "ꌦ", "ㄚ", "Ⲩ", "ⓨ", "Ⓨ", "⒴", "⅄", "ℽ", "Ὺ", "Ῡ", "Ῠ", "Ὗ", "Ὕ", "Ὓ", "Ὑ", "ỿ", "ỹ", "Ỹ", "ỷ", "Ỷ", "ỵ", "Ỵ", "ỳ", "Ỳ", "ẙ", "ẏ", "Ẏ", "ᶌ", "ᖻ", "Ꮍ", "Ꭹ", "ყ", "ฯ", "ץ", "վ", "կ", "Ӳ", "Ӌ", "ұ", "ү", "Ү", "ч", "у", "У", "Ў", "ϔ", "ϓ", "ϒ", "γ", "Υ", "Ύ", "ˠ", "ʸ", "ʏ", "ʎ", "ɣ", "Ɏ", "Ƴ",
        "Ÿ", "ŷ", "Ŷ", "ÿ", "ý", "Ý", "¥", "y", "Y", ":regional_indicator_y:"
    ],
    z: [
        "ｚ", "Ｚ", "🇿", "🆉", "🅩", "🅉", "𝚣", "𝚉", "𝙯", "𝙕", "𝘻", "𝘡", "𝘇", "𝗭", "𝗓", "𝖹", "𝖟", "𝖅", "𝕫", "𝔷", "𝔃", "𝓩", "𝓏", "𝒵", "𝒛", "𝒁", "𝑧", "𝑍", "𝐳", "𝐙", "ꮓ", "ꓜ", "乙", "Ⱬ", "☡", "ⓩ", "Ⓩ", "⒵", "ℨ", "ℤ", "ẕ", "Ẕ", "ẓ", "Ẓ", "ẑ", "Ẑ", "ᶻ", "ᴢ", "ᙆ", "ᘔ", "Ꮓ", "ፚ", "ຊ", "չ", "ζ", "Ζ", "ʑ", "ʐ", "ɀ", "ȥ", "ƹ", "ƶ", "Ƶ", "ž", "Ž", "ż", "Ż", "ź", "Ź", "z", "Z", ":regional_indicator_z:"
    ],

    " ": ["\\s+"],
    ".": ["．"],
    ",": ["，", "‘"],
    "?": ["？"]
});

const lookalikeCharsExps = ObjectUtil.rewriteObject(lookalikeChars, null, chars => new RegExp(chars.join("|"), "gm"));

/* eslint-disable */
const symbolCombiningMarksExp =
    /([\0-\u02FF\u0370-\u1AAF\u1B00-\u1DBF\u1E00-\u20CF\u2100-\uD7FF\uE000-\uFE1F\uFE30-\uFFFF]|[\uD800-\uDBFF][\uDC00-\uDFFF]|[\uD800-\uDBFF](?![\uDC00-\uDFFF])|(?:[^\uD800-\uDBFF]|^)[\uDC00-\uDFFF])([\u0300-\u036F\u1AB0-\u1AFF\u1DC0-\u1DFF\u20D0-\u20FF\uFE20-\uFE2F]+)/g;
const lineBreakCombiningMarksExp =
    /[\0-\x08\x0E-\x1F\x7F-\x84\x86-\x9F\u0300-\u034E\u0350-\u035B\u0363-\u036F\u0483-\u0489\u0591-\u05BD\u05BF\u05C1\u05C2\u05C4\u05C5\u05C7\u0610-\u061A\u061C\u064B-\u065F\u0670\u06D6-\u06DC\u06DF-\u06E4\u06E7\u06E8\u06EA-\u06ED\u0711\u0730-\u074A\u07A6-\u07B0\u07EB-\u07F3\u0816-\u0819\u081B-\u0823\u0825-\u0827\u0829-\u082D\u0859-\u085B\u08D4-\u08E1\u08E3-\u0903\u093A-\u093C\u093E-\u094F\u0951-\u0957\u0962\u0963\u0981-\u0983\u09BC\u09BE-\u09C4\u09C7\u09C8\u09CB-\u09CD\u09D7\u09E2\u09E3\u0A01-\u0A03\u0A3C\u0A3E-\u0A42\u0A47\u0A48\u0A4B-\u0A4D\u0A51\u0A70\u0A71\u0A75\u0A81-\u0A83\u0ABC\u0ABE-\u0AC5\u0AC7-\u0AC9\u0ACB-\u0ACD\u0AE2\u0AE3\u0B01-\u0B03\u0B3C\u0B3E-\u0B44\u0B47\u0B48\u0B4B-\u0B4D\u0B56\u0B57\u0B62\u0B63\u0B82\u0BBE-\u0BC2\u0BC6-\u0BC8\u0BCA-\u0BCD\u0BD7\u0C00-\u0C03\u0C3E-\u0C44\u0C46-\u0C48\u0C4A-\u0C4D\u0C55\u0C56\u0C62\u0C63\u0C81-\u0C83\u0CBC\u0CBE-\u0CC4\u0CC6-\u0CC8\u0CCA-\u0CCD\u0CD5\u0CD6\u0CE2\u0CE3\u0D01-\u0D03\u0D3E-\u0D44\u0D46-\u0D48\u0D4A-\u0D4D\u0D57\u0D62\u0D63\u0D82\u0D83\u0DCA\u0DCF-\u0DD4\u0DD6\u0DD8-\u0DDF\u0DF2\u0DF3\u0F18\u0F19\u0F35\u0F37\u0F39\u0F3E\u0F3F\u0F71-\u0F7E\u0F80-\u0F84\u0F86\u0F87\u0F8D-\u0F97\u0F99-\u0FBC\u0FC6\u135D-\u135F\u1712-\u1714\u1732-\u1734\u1752\u1753\u1772\u1773\u180B-\u180D\u1885\u1886\u18A9\u1920-\u192B\u1930-\u193B\u1A17-\u1A1B\u1A7F\u1AB0-\u1ABE\u1B00-\u1B04\u1B34-\u1B44\u1B6B-\u1B73\u1B80-\u1B82\u1BA1-\u1BAD\u1BE6-\u1BF3\u1C24-\u1C37\u1CD0-\u1CD2\u1CD4-\u1CE8\u1CED\u1CF2-\u1CF4\u1CF8\u1CF9\u1DC0-\u1DF5\u1DFB-\u1DFF\u200C\u200E\u200F\u202A-\u202E\u2066-\u206F\u20D0-\u20F0\u2CEF-\u2CF1\u2D7F\u2DE0-\u2DFF\u302A-\u302F\u3035\u3099\u309A\uA66F-\uA672\uA674-\uA67D\uA69E\uA69F\uA6F0\uA6F1\uA802\uA806\uA80B\uA823-\uA827\uA880\uA881\uA8B4-\uA8C5\uA8E0-\uA8F1\uA926-\uA92D\uA947-\uA953\uA980-\uA983\uA9B3-\uA9C0\uAA29-\uAA36\uAA43\uAA4C\uAA4D\uAAEB-\uAAEF\uAAF5\uAAF6\uABE3-\uABEA\uABEC\uABED\uFB1E\uFE00-\uFE0F\uFE20-\uFE2F\uFFF9-\uFFFB]|\uD800[\uDDFD\uDEE0\uDF76-\uDF7A]|\uD802[\uDE01-\uDE03\uDE05\uDE06\uDE0C-\uDE0F\uDE38-\uDE3A\uDE3F\uDEE5\uDEE6]|\uD804[\uDC00-\uDC02\uDC38-\uDC46\uDC7F-\uDC82\uDCB0-\uDCBA\uDD00-\uDD02\uDD27-\uDD34\uDD73\uDD80-\uDD82\uDDB3-\uDDC0\uDDCA-\uDDCC\uDE2C-\uDE37\uDE3E\uDEDF-\uDEEA\uDF00-\uDF03\uDF3C\uDF3E-\uDF44\uDF47\uDF48\uDF4B-\uDF4D\uDF57\uDF62\uDF63\uDF66-\uDF6C\uDF70-\uDF74]|\uD805[\uDC35-\uDC46\uDCB0-\uDCC3\uDDAF-\uDDB5\uDDB8-\uDDC0\uDDDC\uDDDD\uDE30-\uDE40\uDEAB-\uDEB7]|\uD807[\uDC2F-\uDC36\uDC38-\uDC3F\uDC92-\uDCA7\uDCA9-\uDCB6]|\uD81A[\uDEF0-\uDEF4\uDF30-\uDF36]|\uD81B[\uDF51-\uDF7E\uDF8F-\uDF92]|\uD82F[\uDC9D\uDC9E\uDCA0-\uDCA3]|\uD834[\uDD65-\uDD69\uDD6D-\uDD82\uDD85-\uDD8B\uDDAA-\uDDAD\uDE42-\uDE44]|\uD836[\uDE00-\uDE36\uDE3B-\uDE6C\uDE75\uDE84\uDE9B-\uDE9F\uDEA1-\uDEAF]|\uD838[\uDC00-\uDC06\uDC08-\uDC18\uDC1B-\uDC21\uDC23\uDC24\uDC26-\uDC2A]|\uD83A[\uDCD0-\uDCD6\uDD44-\uDD4A]|\uDB40[\uDC01\uDC20-\uDC7F\uDD00-\uDDEF]/g;
/* eslint-enable */

function onlyNormalChars(str) {
    return normalCharsExp.test(str);
}

function stripCombiningMarks(str) {
    lineBreakCombiningMarksExp.lastIndex = 0;
    symbolCombiningMarksExp.lastIndex = 0;

    let clean = str.replace(lineBreakCombiningMarksExp, "");
    return clean.replace(symbolCombiningMarksExp, "$1");
}

function normalizeText(str) {
    if (!onlyNormalChars(str)) {
        for (const char of Object.keys(lookalikeCharsExps)) {
            lookalikeCharsExps[char].lastIndex = 0;
            str = str.replace(lookalikeCharsExps[char], char);
        }
    }

    return stripCombiningMarks(str.toLowerCase());
}

export default normalizeText;
